CF/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АналитикаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикаХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/CommonModules/ЗапасыСерверВызовСервера/Ext/Module.bsl
// Функция возвращает список документов продажи, в ТЧ Товары которых
// присутствует передаваемая как параметр Номенклатура.
//
// Параметры:
//  СтруктураПараметров - структура.
//
// Возвращаемое значение:
//  СписокЗначений - таблица документов и реквизитов.
//
Функция ПолучитьСписокДокументовСодержащихНоменклатуру(СтруктураПараметров) Экспорт
	
	Результат = Новый СписокЗначений;
	ЗаданРеквизитЦенаВключаетНДС = Ложь;
	ПреварительныйМассивДокументов = Новый Массив;
	
	Если СтруктураПараметров.Свойство("ЦенаВключаетНДС") Тогда
		
		ЗаданРеквизитЦенаВключаетНДС = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Магазин = &Магазин
		|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И ОтчетОРозничныхПродажах.ЦенаВключаетНДС = &ЦенаВключаетНДС
		|	И ОтчетОРозничныхПродажах.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваров.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.Магазин = &Магазин
		|	И РеализацияТоваров.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И РеализацияТоваров.Проведен
		|	И РеализацияТоваров.ЦенаВключаетНДС = &ЦенаВключаетНДС";
		
		Запрос.УстановитьПараметр("ДатаС", СтруктураПараметров.ДатаС);
		Запрос.УстановитьПараметр("ДатаПо", ТекущаяДатаСеанса() + 24*60*60); // Смена иногда переходит на новые сутки.
		Запрос.УстановитьПараметр("Магазин", СтруктураПараметров.Магазин);
		Запрос.УстановитьПараметр("ЦенаВключаетНДС", СтруктураПараметров.ЦенаВключаетНДС);
		
		ПредварительныйРезультат = Запрос.Выполнить();
		ПреварительныйМассивДокументов = ПредварительныйРезультат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаС,
	|			&ДатаПо,
	|			,
	|			НЕ ДокументПродажи ССЫЛКА Документ.ЧекККМ
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Магазин = &Магазин
	|				И (НЕ &ЗаданРеквизитЦенаВключаетНДС
	|					ИЛИ ДокументПродажи В (&ПреварительныйМассивДокументов))) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.КоличествоОборот > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ДокументПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументПродажи
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("Магазин", СтруктураПараметров.Магазин);
	Запрос.УстановитьПараметр("ДатаС", СтруктураПараметров.ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", ТекущаяДатаСеанса() + 24*60*60); // Смена иногда переходит на новые сутки.
	Запрос.УстановитьПараметр("ДатаС", СтруктураПараметров.ДатаС);
	Запрос.УстановитьПараметр("ПреварительныйМассивДокументов", ПреварительныйМассивДокументов);
	Запрос.УстановитьПараметр("ЗаданРеквизитЦенаВключаетНДС"  , ЗаданРеквизитЦенаВключаетНДС);
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументПродажи");
	
	Результат.ЗагрузитьЗначения(МассивДокументов);
	
	Возврат Результат;

КонецФункции

// Функция получения документа-основания на оформление излишков и недостач товаров.
//
Функция ПолучитьОснованиеОформленияИзлишковНедостачТоваров(ДокументСсылка) Экспорт 
	
	Основание = Неопределено;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров") Тогда
		
		Основание = ДокументСсылка;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОрдерНаОтражениеРезультатовПересчетовТоваров") Тогда 
		
		Основание = ДокументСсылка.ДокументОснование;
		
	Иначе
		
		Основание = ДокументСсылка;
		
	КонецЕсли;
	
	Возврат Основание;
	
	
КонецФункции
